app/Controllers/About.php

    public function index()
    {
        $homeModel = new Home();
        $homes = $homeModel->findAll();
---
SELECT *
FROM `home`