app/Controllers/Agent.php

    public function index()
    {
        $agent = New Agents();

        $data['agents'] = $agent->findAll();
---
SELECT *
FROM `agents`

    public function detail($id)
    {
        $agentModel = new Agents();
        $agent = $agentModel->find($id);
---
SELECT *
FROM `agents`
WHERE `agents`.`id` = '24'