app/Controllers/Coaching.php

SELECT *
FROM `schedule`
WHERE `status` != 'Accepted'
AND `status` != 'Declined'
---
    public function index()
    {
        $scheduleModel = new Schedule();
        $data['coaching'] = $scheduleModel->where('status !=', 'Accepted')->where('status !=', 'Declined')->findAll();

SELECT *
FROM `home`
---
    public function payment()
    {
        $homeModel = new Home();
        $homes = $homeModel->findAll();