app/Controllers/Map.php

SELECT *
FROM `maps`
---
    public function index()
    {
        $mapModel = new Maps();
        $data['maps'] = $mapModel->findAll();

SELECT *
FROM `maps`
WHERE `maps`.`id` = '1'
SELECT *
FROM `agents`
WHERE `id` IN (1,12,13,5,21)
---
    public function detail($id)
    {
        $mapModel = new Maps();
        $agentModel = new Agents();
        $map = $mapModel->find($id);

        // Daftar ID agen yang ditampilkan berdasarkan ID map
        $mapAgentIds = [
            1 => [1, 12, 13, 5, 21],
            2 => [11, 4, 8, 10, 13],
            3 => [1, 12, 13, 5, 21],
            4 => [1, 12, 13, 5, 21],
            5 => [1, 12, 13, 5, 21],
            6 => [1, 12, 13, 5, 21],
            7 => [1, 12, 13, 5, 21],
            8 => [1, 12, 13, 5, 21],
            9 => [1, 12, 13, 5, 21],
            10 => [1, 12, 13, 5, 21],
        ];

        // Periksa apakah map ditemukan dan ambil agen yang sesuai
        if ($map) {
            $agents = [];
            if (isset($mapAgentIds[$id])) {
                $agentIds = $mapAgentIds[$id];
                $agentsData = $agentModel->whereIn('id', $agentIds)->findAll();